#-----------------------تعریف تابع برای عملیات تبدیل اعداد در مبنای 2--------------------
def bin():            
    kh_gh = [0,0,0,0,0,0,0,0,0]
    bagh = [0,0,0,0,0,0,0,0,0]
#----------------دریافت دیتا از کاربر------------------------------   
    a = int(input("ENTER THE NUMBER:"))
#--------------انجام اعمال ریاضیی بررای تبدیل بر مبنای 2--------------------------
    bagh[0] =  a % 2
    kh_gh[0] = a // 2
#---------------حلقه شمارنده برای تکرار عملیات های ریاضی--------------------------
    for i in range(0,8):
        kh_gh[i+1] =  kh_gh[i] // 2
        bagh[i+1] =  kh_gh[i] % 2
    print (bagh[7],bagh[6],bagh[5],bagh[4],bagh[3],bagh[2],bagh[1],bagh[0])
#-----------------فراخوانی تابع تبدیل مبنا------------------------------------
bin()